RT-Thread/rt-thread/bsp/cy8c6347bzi-cy-062/CY8C6347BZI/Test.cydsn/Generated_Source/PSoC6/pdl/drivers/peripheral/sysclk/cy_sysclk.c
    if (callbackParams != NULL)
    {

        /* Entry into Deep Sleep mode tests */
        if (mode == CY_SYSPM_CHECK_READY)
        {
            /* Don't allow entry into Deep Sleep mode if currently measuring a frequency. */
            if (clkCounting)
            {
                retVal = CY_SYSPM_FAIL;
            }
            else 
            { /* Indicating that we can go into Deep Sleep. Before doing so ... */
                uint32_t fllpll; /* 0 = FLL, all other values = a PLL */

                /* initialize record of changed paths */
                changedSourcePaths = 0U;

                /* for FLL and each PLL, */
                for (fllpll = 0UL; fllpll < (CY_SRSS_NUM_PLL + 1UL); fllpll++)
                {
                    /* If FLL or PLL is enabled, */
                    if (0UL != ((fllpll == 0UL) ? (_FLD2VAL(SRSS_CLK_FLL_CONFIG_FLL_ENABLE, SRSS_CLK_FLL_CONFIG)) : 
                                                  (_FLD2VAL(SRSS_CLK_PLL_CONFIG_ENABLE, SRSS_CLK_PLL_CONFIG[fllpll - 1UL]))))
                    {
                        /* and the FLL or PLL has ECO as a source, */
                        if (Cy_SysClk_ClkPathGetSource(fllpll) == CY_SYSCLK_CLKPATH_IN_ECO)
                        {
                            /* Change this FLL or PLL source to IMO */
                            (void)Cy_SysClk_ClkPathSetSource(fllpll, CY_SYSCLK_CLKPATH_IN_IMO);
                            /* keep a record that this FLL or PLL's source was changed from ECO */
                            changedSourcePaths |= (uint16_t)(1UL << fllpll);
                        }
                        
                        /* Set the FLL/PLL bypass mode to 2 */
                        if(fllpll == 0UL)
                        {
                            CY_REG32_CLR_SET(SRSS_CLK_FLL_CONFIG3, SRSS_CLK_FLL_CONFIG3_BYPASS_SEL, (uint32_t)CY_SYSCLK_FLLPLL_OUTPUT_INPUT);
                        }
                        else
                        {
                            CY_REG32_CLR_SET(SRSS_CLK_PLL_CONFIG[fllpll - 1UL], SRSS_CLK_PLL_CONFIG_BYPASS_SEL, (uint32_t)CY_SYSCLK_FLLPLL_OUTPUT_INPUT);
                        }
                    }
                }
                
                /* Prevent starting a new clock measurement until after we've come back from Deep Sleep. */
                preventCounting = true;
            }
        }

        /* After return from Deep Sleep, for each FLL and PLL, if needed, restore the source to ECO.
           And block until the FLL or PLL has regained its frequency locks. */
        else if (mode == CY_SYSPM_AFTER_TRANSITION)
        {
            /* if any FLL/PLL was sourced by the ECO, timeout wait for the ECO to become fully stabilized again. */
            if (0U != changedSourcePaths)
            {
                uint32_t timeout = TIMOUT_COUNT;
                /* Cy_SysClk_EcoGetStatus()return value 2UL = fully stabilized */
                while ((CY_SYSCLK_ECOSTAT_STABLE != Cy_SysClk_EcoGetStatus()) && (timeout > 0UL))
                {
                    timeout--;
                }
                
                if (timeout == 0UL)
                {
                    retVal = CY_SYSPM_TIMEOUT;
                }
            }
            
            if(retVal == CY_SYSPM_SUCCESS)
            {
                /* for FLL and each PLL, */
                uint32_t fllpll; /* 0 = FLL, all other values = a PLL */
                for (fllpll = 0UL; fllpll < (CY_SRSS_NUM_PLL + 1UL); fllpll++)
                {
                    /* If FLL or PLL is enabled, */
                    if (0UL != ((fllpll == 0UL) ? (_FLD2VAL(SRSS_CLK_FLL_CONFIG_FLL_ENABLE, SRSS_CLK_FLL_CONFIG)) : 
                                                  (_FLD2VAL(SRSS_CLK_PLL_CONFIG_ENABLE, SRSS_CLK_PLL_CONFIG[fllpll - 1UL]))))
                    {
                        uint32_t timeout;
                        
                        /* check the record that this FLL or PLL's source was changed from ECO */
                        if ((changedSourcePaths & (uint16_t)(1UL << fllpll)) != 0U)
                        {
                            /* Change this FLL or PLL source back to ECO */
                            (void)Cy_SysClk_ClkPathSetSource(fllpll, CY_SYSCLK_CLKPATH_IN_ECO);
                        }
                        
                        /* Timeout wait for FLL or PLL to regain lock. */
                        for (timeout = TIMOUT_COUNT; timeout != 0UL; timeout--)
                        {
                            if (true == ((fllpll == 0UL) ? Cy_SysClk_FllLocked() : Cy_SysClk_PllLocked(fllpll)))
                            {
                                break;
                            }
                        }
                        
                        if (timeout == 0UL)
                        {
                            retVal = CY_SYSPM_TIMEOUT;
                        }
                        else
                        {
                            /* Set the FLL/PLL bypass mode to 3 */
                            if(fllpll == 0UL)
                            {
                                CY_REG32_CLR_SET(SRSS_CLK_FLL_CONFIG3, SRSS_CLK_FLL_CONFIG3_BYPASS_SEL, (uint32_t)CY_SYSCLK_FLLPLL_OUTPUT_OUTPUT);
                            }
                            else
                            {
                                CY_REG32_CLR_SET(SRSS_CLK_PLL_CONFIG[fllpll - 1UL], SRSS_CLK_PLL_CONFIG_BYPASS_SEL, (uint32_t)CY_SYSCLK_FLLPLL_OUTPUT_OUTPUT);
                            }
                        }
                    }
                }
            }
            
            /* Allow clock measurement. */
            preventCounting = false;
        }

        /* No other modes need be checked. */
        else
        {
        }
    }
    return retVal;
}
/** \} group_sysclk_pm_funcs */


/* ========================================================================== */
/* =====================    clk_peripherals SECTION    ====================== */
/* ========================================================================== */


/**
* \addtogroup group_sysclk_clk_peripheral_funcs
* \{
*/
/*******************************************************************************
* Function Name: Cy_SysClk_PeriphGetFrequency
****************************************************************************//**
*
* Reports the frequency of the output of a given peripheral divider.
*
* \param dividerType specifies which type of divider to use; \ref cy_en_divider_types_t
*
* \param dividerNum specifies which divider of the selected type to configure
*
* \return The frequency, in Hz.
*
* \note
* The reported frequency may be zero, which indicates unknown. This happens if
* the source input is clk_ext, ECO, clk_althf, dsi_out, or clk_altlf.
*
* \funcusage
* \snippet sysclk/1.20/snippet/main.c snippet_Cy_SysClk_PeriphGetFrequency
*
*******************************************************************************/
uint32_t Cy_SysClk_PeriphGetFrequency(cy_en_divider_types_t dividerType, uint32_t dividerNum)
{
    /* variables holding intermediate clock frequencies, dividers and FLL/PLL settings */
    bool     enabled = false;      /* FLL or PLL enable status; n/a for direct */
    uint32_t freq = 0UL;           /* path (FLL, PLL, or direct) frequency, in Hz, 0 = unknown frequency */
    uint32_t rootDiv = 0UL;        /* root prescaler (1/2/4/8) */
    uint32_t periDiv = 0UL;        /* predivider to clk_peri */
    uint32_t fDiv = 0UL;           /* FLL/PLL multiplier/feedback divider */
    uint32_t rDiv = 0UL;           /* FLL/PLL reference divider */
    uint32_t oDiv = 0UL;           /* FLL/PLL output divider */
    uint32_t integer = 0UL;        /* Integer part of peripheral divider */
    uint32_t frac = 0UL;           /* Fractional part of peripheral divider */
    cy_en_clkhf_in_sources_t    path   = Cy_SysClk_ClkHfGetSource(0UL); /* path input for root 0 (clkHf[0]) */
    cy_en_clkpath_in_sources_t  source = Cy_SysClk_ClkPathGetSource((uint32_t)path); /* source input for path (FLL, PLL, or direct) */

    CY_ASSERT_L1(((dividerType == CY_SYSCLK_DIV_8_BIT)    && (dividerNum < PERI_DIV_8_NR))    ||
                 ((dividerType == CY_SYSCLK_DIV_16_BIT)   && (dividerNum < PERI_DIV_16_NR))   ||
                 ((dividerType == CY_SYSCLK_DIV_16_5_BIT) && (dividerNum < PERI_DIV_16_5_NR)) ||
                 ((dividerType == CY_SYSCLK_DIV_24_5_BIT) && (dividerNum < PERI_DIV_24_5_NR)));

    /* get the frequency of the source, i.e., the path mux input */
    switch(source)
    {
        case CY_SYSCLK_CLKPATH_IN_IMO: /* IMO frequency is fixed at 8 MHz */
            freq = 8000000UL; /*Hz*/
            break;
        case CY_SYSCLK_CLKPATH_IN_ILO: /* ILO, WCO and PILO frequencies are nominally 32.768 kHz */
        case CY_SYSCLK_CLKPATH_IN_WCO:
        case CY_SYSCLK_CLKPATH_IN_PILO:
            freq = 32768UL; /*Hz*/
            break;
        default:
            /* don't know the frequency of clk_ext, ECO, clk_althf, dsi_out, or clk_altlf */
            freq = 0UL; /* unknown frequency */
            break;
    }

    if (path == CY_SYSCLK_CLKHF_IN_CLKPATH0) /* FLL? (always path 0) */
    {
        cy_stc_fll_manual_config_t fllCfg = {0UL,0U,CY_SYSCLK_FLL_CCO_RANGE0,false,0U,0U,0U,0U,CY_SYSCLK_FLLPLL_OUTPUT_AUTO,0U};
        Cy_SysClk_FllGetConfiguration(&fllCfg);
        enabled = (_FLD2BOOL(SRSS_CLK_FLL_CONFIG_FLL_ENABLE, SRSS_CLK_FLL_CONFIG)) && (fllCfg.outputMode != CY_SYSCLK_FLLPLL_OUTPUT_INPUT);
        fDiv = fllCfg.fllMult;
        rDiv = fllCfg.refDiv;
        oDiv = (fllCfg.enableOutputDiv) ? 2UL : 1UL;
    }
    else if ((uint32_t)path <= CY_SRSS_NUM_PLL) /* PLL? (always path 1...N)*/
    {
        cy_stc_pll_manual_config_t pllcfg = {0U,0U,0U,false,CY_SYSCLK_FLLPLL_OUTPUT_AUTO};
        (void)Cy_SysClk_PllGetConfiguration((uint32_t)path, &pllcfg);
        enabled = (_FLD2BOOL(SRSS_CLK_PLL_CONFIG_ENABLE, SRSS_CLK_PLL_CONFIG[(uint32_t)path - 1UL])) && (pllcfg.outputMode != CY_SYSCLK_FLLPLL_OUTPUT_INPUT);
        fDiv = pllcfg.feedbackDiv;
        rDiv = pllcfg.referenceDiv;
        oDiv = pllcfg.outputDiv;
    }
    else
    {
        /* Direct select path  */
    }

    if (enabled) /* if FLL or PLL enabled and not bypassed */
    {
        freq = (uint32_t)(((uint64_t)freq * (uint64_t)fDiv) /
                          ((uint64_t)rDiv * (uint64_t)oDiv));
    }
    
    /* get the prescaler value for root 0, or clkHf[0]: 1/2/4/8 */
    rootDiv = 1UL << (uint32_t)Cy_SysClk_ClkHfGetDivider(0UL);

    /* get the predivider value for clkHf[0] to clk_peri */
    periDiv = 1UL + (uint32_t)Cy_SysClk_ClkPeriGetDivider();

    /* Divide the path input frequency down and return the result.
       Stepping through the following code shows the frequency at each stage.
    */
    freq /= (rootDiv * periDiv); /* clk_peri frequency */

    /* get the divider value for clk_peri to the selected peripheral clock */
    switch(dividerType)
    {
        case CY_SYSCLK_DIV_8_BIT:
        case CY_SYSCLK_DIV_16_BIT:
            integer = (uint32_t)Cy_SysClk_PeriphGetDivider(dividerType, dividerNum);
            /* frac = 0 means it is an integer divider */
            break;
        case CY_SYSCLK_DIV_16_5_BIT:
        case CY_SYSCLK_DIV_24_5_BIT:
            (void)Cy_SysClk_PeriphGetFracDivider(dividerType, dividerNum, &integer, &frac);
            break;
        default:
            break;
    }

    /* For fractional dividers, the divider is (int + 1) + frac/32.
     * Use the fractional value to round the divider to the nearest integer.
     */
    freq /= (integer + 1UL + ((frac >= 16UL) ? 1UL : 0UL)); /* peripheral divider output frequency */

    return freq;
}
/** \} group_sysclk_clk_peripheral_funcs */


/* [] END OF FILE */
